app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", "6"]]
---
  def index
    @comments = @post.comments.order(created_at: :desc)

INSERT INTO "comments" ("title", "content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hello World"], ["content", "Merhaba"], ["user_id", 1], ["post_id", "5"], ["created_at", "2021-10-11 20:24:48.572023"], ["updated_at", "2021-10-11 20:24:48.572023"]]
---
    def create
      @comment = @post.comments.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", "5"], ["id", 1], ["LIMIT", 1]]
---
    def show
      @comment = @post.comments.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", "5"], ["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "updated_at" = $1, "accepted" = $2 WHERE "comments"."id" = $3  [["updated_at", "2021-10-28 07:57:30.696179"], ["accepted", true], ["id", 1]]
---
    def accept
    @comment = @post.comments.find(params[:id])
    @comment.update(accepted: true)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", "5"], ["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "updated_at" = $1, "accepted" = $2 WHERE "comments"."id" = $3  [["updated_at", "2021-10-28 07:57:34.367308"], ["accepted", false], ["id", 1]]
---
    def deny
    @comment = @post.comments.find(params[:id])
    @comment.update(accepted: false)